chat_system_1266725299_actor_description=King Mark. Your King.
chat_system_1266725299_snap_0_question=^?^So, what news do you bring of the slave traders? How far have these pests spread into Darion's lands?
chat_system_1266725299_snap_0_answer_0=^?^Your Majesty! Everything is much worse than it seems. It appears that we have been betrayed, that Baron Ahey has involved himself in a treasonous plot! (Retell Hake's story...)
chat_system_1266725299_snap_0_answer_1=^?^I would like to know more about the laws connected with slave trade in Darion.
chat_system_1266725299_snap_2_question=^?^That explains it. Well done, [player]. So it turns out that those robbers, hired by the baron, attacked Torn Digor's envoys as they were coming to pay their lease of the mines? And we swallowed that scoundrel's bait! - We sold the rights to the mines to Baron Ahey, because we didn't get the gold from the dwarves in time.<br>Not knowing anything was wrong - the dwarven king was sure that we got the gold - he sent his pitmen to the mines where they were met by Ahey's armed cutthroats, ambushed, and killed. It's not surprising that the dwarven king sent in his troops! But what shall we do now?<br>[reward]
chat_system_1266725299_snap_2_answer_0=^?^I think that it's time to visit Baron Ahey... Confronting him directly seems to be the right idea...
chat_system_1266725299_snap_3_question=^?^Yes, the baron shall suffer the punishment he deserves... But it's much more important to settle this misunderstanding, and restore peace with the dwarves! <br>So, you, [player], are departing to Kordar, to the dwarven King, Torn Digor, on a diplomatic mission! Apologize to His Majesty on our behalf and conclude a new peace treaty with him. For our part, we are ready to repay the dwarves' losses twofold, and grant them full reign in the Creiston Mines for one hundred years, rent-free.
chat_system_1266725299_snap_3_answer_0=^?^Why me? This mission would be rather more fitting for a true diplomat.
chat_system_1266725299_snap_4_question=^?^Ha-ha, [player]. First, because of the traitor Ahey. We shall sentence him to death, and you must carry out the sentence. Second, the dwarves and monsters living down there will hardly be glad to see you.<br>Third, because Torn Digor will far more readily sign a treaty with one he considers a worthy warrior. He's a true dwarf, a war dog. He respects strength - and if he feels it in you, he'll sign whatever you want. Understood?
chat_system_1266725299_snap_4_answer_0=^?^Yes, I understand. I am off, Your Majesty.
chat_system_1266725299_snap_1_question=^?^Long ago, during the rule of the Mellis dynasty, the slave trade was a part of everyday life. But when at last the throne was returned to the Leonard family, laws restricting slave trade were passed. The law prohibited trade of any living intelligent creatures against their will, or the consideration of them as property. The punishment for breaking the law was lifelong penal servitude, or death sentence with no right to pardon or reprieve!<br>Of course, ambitious tradesmen quickly found loopholes in that law - for instance, zombies and vampires can't be considered living creatures, and orcs, they argue, are not intelligent enough, so for a time, the slave trade was held together by trading undead creatures and stupid creatures, but eventually it all stopped.
chat_system_1266725299_snap_1_answer_0=^?^Thank you, I won't detain you from your affairs of state any longer.
